CotizadorPlanes/.svn/pristine/52/522836c3088f3372944d480af55650216c0d9be1.svn-base

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="CotizadorPlanes"
	targetNamespace="http://osde.com.ar/services/CotizadorPlanes"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://osde.com.ar/services/CotizadorPlanes"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
	<wsdl:types>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:tns="http://osde.com.ar/services/CotizadorPlanes"
			attributeFormDefault="unqualified" elementFormDefault="unqualified"
			targetNamespace="http://osde.com.ar/services/CotizadorPlanes">
			<xs:element name="getEsquemaFamiliar" type="tns:getEsquemaFamiliar" />
			<xs:element name="getEsquemaFamiliarResponse" type="tns:getEsquemaFamiliarResponse" />
			<xs:element name="getPlanes" type="tns:getPlanes" />
			<xs:element name="getPlanesResponse" type="tns:getPlanesResponse" />
			<xs:complexType name="getPlanes">
				<xs:sequence />
			</xs:complexType>
			<xs:complexType name="getPlanesResponse">
				<xs:sequence>
					<xs:element form="qualified" minOccurs="0" name="PlanCotizador"
						type="tns:searchResult" />
				</xs:sequence>
			</xs:complexType>
			<xs:complexType name="searchResult">
				<xs:sequence>
					<xs:element maxOccurs="unbounded" minOccurs="0" name="list"
						nillable="true" type="xs:anyType" />
					<xs:element minOccurs="0" name="totalResults" type="xs:int" />
					<xs:element minOccurs="0" name="truncated" type="xs:boolean" />
				</xs:sequence>
			</xs:complexType>
			<xs:complexType name="planCotizador">
				<xs:sequence>
					<xs:element name="id" type="xs:int" />
					<xs:element minOccurs="0" name="numero" type="xs:string" />
					<xs:element minOccurs="0" name="prefijoPlan" type="xs:string" />
				</xs:sequence>
			</xs:complexType>
			<xs:complexType name="getEsquemaFamiliar">
				<xs:sequence />
			</xs:complexType>
			<xs:complexType name="getEsquemaFamiliarResponse">
				<xs:sequence>
					<xs:element form="qualified" minOccurs="0" name="EsquemaFamiliar"
						type="tns:searchResult" />
				</xs:sequence>
			</xs:complexType>
			<xs:complexType name="esquemaFamiliar">
				<xs:sequence>
					<xs:element minOccurs="0" name="codigoTipoEsquemaFamiliar"
						type="xs:string" />
					<xs:element minOccurs="0" name="descripcionEsquemaFamiliar"
						type="xs:string" />
				</xs:sequence>
			</xs:complexType>
			<xs:element name="ServiceException" type="tns:ServiceException" />
			<xs:complexType name="ServiceException">
				<xs:sequence />
			</xs:complexType>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="getPlanesResponse">
		<wsdl:part name="parameters" element="tns:getPlanesResponse">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="getPlanes">
		<wsdl:part name="parameters" element="tns:getPlanes">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="ServiceException">
		<wsdl:part name="ServiceException" element="tns:ServiceException">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="getEsquemaFamiliarResponse">
		<wsdl:part name="parameters" element="tns:getEsquemaFamiliarResponse">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="getEsquemaFamiliar">
		<wsdl:part name="parameters" element="tns:getEsquemaFamiliar">
		</wsdl:part>
	</wsdl:message>
	<wsdl:portType name="CotizadorPlanes">
		<wsdl:operation name="getPlanes">
			<wsdl:input name="getPlanes" message="tns:getPlanes">
			</wsdl:input>
			<wsdl:output name="getPlanesResponse" message="tns:getPlanesResponse">
			</wsdl:output>
			<wsdl:fault name="ServiceException" message="tns:ServiceException">
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getEsquemaFamiliar">
			<wsdl:input name="getEsquemaFamiliar" message="tns:getEsquemaFamiliar">
			</wsdl:input>
			<wsdl:output name="getEsquemaFamiliarResponse" message="tns:getEsquemaFamiliarResponse">
			</wsdl:output>
			<wsdl:fault name="ServiceException" message="tns:ServiceException">
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="CotizadorPlanesServiceSoapBinding"
		type="tns:CotizadorPlanes">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="getPlanes">
			<soap:operation soapAction="" style="document" />
			<wsdl:input name="getPlanes">
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output name="getPlanesResponse">
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="ServiceException">
				<soap:fault name="ServiceException" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getEsquemaFamiliar">
			<soap:operation soapAction="" style="document" />
			<wsdl:input name="getEsquemaFamiliar">
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output name="getEsquemaFamiliarResponse">
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="ServiceException">
				<soap:fault name="ServiceException" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="CotizadorPlanes">
		<wsdl:port name="CotizadorPlanesPort" binding="tns:CotizadorPlanesServiceSoapBinding">
			<soap:address location="http://localhost:9090/CotizadorPlanesPort" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
