CotizadorPlanes/src/test/resources/integrationTest/serviceSoapRequest/getPlanesSoapRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cot="http://osde.com.ar/services/CotizadorPlanes">
   <soapenv:Header/>
   <soapenv:Body>
      <cot:getPlanes/>
   </soapenv:Body>
</soapenv:Envelope>